SQLite GLOB operator is used to match only text values against a pattern using wildcards. If the search expression can be matched to the pattern expression, the GLOB operator will return true, which is 1. Unlike LIKE operator, GLOB is case sensitive and it follows syntax of UNIX for specifying THE following wildcards.
- The asterisk sign (*)
- The question mark sign (?)

The asterisk sign (*) represents zero or multiple numbers or characters. The question mark (?) represents a single number or character.

## Syntax

Following is the basic syntax of * and ?.

```sql
SELECT FROM table_name
WHERE column GLOB 'XXXX*'
or 
SELECT FROM table_name
WHERE column GLOB '*XXXX*'
or
SELECT FROM table_name
WHERE column GLOB 'XXXX?'
or
SELECT FROM table_name
WHERE column GLOB '?XXXX'
or
SELECT FROM table_name
WHERE column GLOB '?XXXX?'
or
SELECT FROM table_name
WHERE column GLOB '????'
```

You can combine N number of conditions using AND or OR operators. Here, XXXX could be any numeric or string value.

## Example

Following table lists a number of examples showing WHERE part having different GLOB clause with '*' and '?' operators.

<table>
    <tr>
        <th>No.</th>
        <th>Statement & Description</th>
    </tr>
    <tr>
        <td>1</td>
        <td>WHERE SALARY GLOB '200*'<br>Finds any values that start with 200</td>
    </tr>
    <tr>
        <td>2</td>
        <td>WHERE SALARY GLOB '*200*'<br>Finds any values that have 200 in any position</td>
    </tr>
    <tr>
        <td>3</td>
        <td>WHERE SALARY GLOB '?00*'<br>Finds any values that have 00 in the second and third positions</td>
    </tr>
    <tr>
        <td>4</td>
        <td>WHERE SALARY GLOB '2??''<br>Finds any values that start with 2 and are at least 3 characters in length</td>
    </tr>
    <tr>
        <td>5</td>
        <td>WHERE SALARY GLOB '*2'<br>Finds any values that end with 2</td>
    </tr>
    <tr>
        <td>6</td>
        <td>WHERE SALARY GLOB '?2*3'<br>Finds any values that have a 2 in the second position and end with a 3</td>
    </tr>
    <tr>
        <td>7</td>
        <td>WHERE SALARY GLOB '2???3'<br>Finds any values in a five-digit number that start with 2 and end with 3</td>
    </tr>
</table>

Let us take a real example, consider COMPANY table with the following records âˆ’

```bash
ID          NAME        AGE         ADDRESS     SALARY
----------  ----------  ----------  ----------  ----------
1           Paul        32          California  20000.0
2           Allen       25          Texas       15000.0
3           Teddy       23          Norway      20000.0
4           Mark        25          Rich-Mond   65000.0
5           David       27          Texas       85000.0
6           Kim         22          South-Hall  45000.0
7           James       24          Houston     10000.0
```

Following is an example, which will display all the records from COMPANY table, where AGE starts with 2.

```bash
sqlite> SELECT * FROM COMPANY WHERE AGE  GLOB '2*';
```

This will produce the following result.

```bash
ID          NAME        AGE         ADDRESS     SALARY
----------  ----------  ----------  ----------  ----------
2           Allen       25          Texas       15000.0
3           Teddy       23          Norway      20000.0
4           Mark        25          Rich-Mond   65000.0
5           David       27          Texas       85000.0
6           Kim         22          South-Hall  45000.0
7           James       24          Houston     10000.0
```

Following is an example, which will display all the records from COMPANY table where ADDRESS will have a hyphen (-) inside the text

```bash
sqlite> SELECT * FROM COMPANY WHERE ADDRESS  GLOB '*-*';
```

This will produce the following result.

```bash
ID          NAME        AGE         ADDRESS     SALARY
----------  ----------  ----------  ----------  ----------
4           Mark        25          Rich-Mond   65000.0
6           Kim         22          South-Hall  45000.0
```